system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p|pcorr"
    {
        solver          GAMG;
        tolerance       1e-4;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps	 0;
        nPostSweeps	 2;
        cacheAgglomeration on;
        agglomerator	 faceAreaPair;
        nCellsInCoarsestLevel 1000;
        mergeLevels	 1;
//        preconditioner  Cholesky;
        minIter         3;
        maxIter         1000;
    }
    "pFinal|pcorrFinal"
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.0;
        smoother        GaussSeidel;
        nPreSweeps	 0;
        nPostSweeps	 2;
        cacheAgglomeration on;
        agglomerator	 faceAreaPair;
        nCellsInCoarsestLevel 1000;
        mergeLevels	 1;
//        preconditioner  Cholesky;
        minIter         3;
        maxIter         1000;
    }
     "U|UFinal"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        minIter          3;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0.0;
    }
        "Phi"
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-06;
        relTol          0.01;
    }
    cellMotionUx
    {
    	solver		PCG;
    	preconditioner	DIC;
    	tolerance	1e-08;
    	relTol		0;
    }
    cellMotionUxFinal
    {
    	solver		PCG;
    	preconditioner	DIC;
    	tolerance	1e-08;
    	relTol		0;
    }
    "cellDisplacement.*"
    {
    	solver		GAMG;
    	tolerance	1e-05;
    	relTol		0;
    	smoother	GaussSeidel;
    	chacheAgglomeration	true;
    	nCellsInCoarsestLevel	10;
    	agglomerator	faceAreaPair;
    	mergeLevels	1;
    } 
}

PIMPLE
{
    nOuterCorrectors 5;
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
    pRefPoint (10 -0.45 0.04);
    pRefValue 0;
    checkMeshCourantNo no;
    correctPhi yes;
    moveOuterMesh	on;
    moveMeshOuterCorrectors yes;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    equations
    {
        p	   0.3;
        U         0.7;
        UFinal    0.7;
    }
    fields
    {
    }
}


// ************************************************************************* //
